{
  "_class_name": "SD3ControlNetModel",
  "_diffusers_version": "0.31.0.dev0",
  "_name_or_path": "downloads/stable-diffusion-3-medium-diffusers/",
  "attention_head_dim": 64,
  "caption_projection_dim": 1536,
  "extra_conditioning_channels": 0,
  "in_channels": 16,
  "joint_attention_dim": 4096,
  "num_attention_heads": 24,
  "num_layers": 12,
  "out_channels": 16,
  "patch_size": 2,
  "pooled_projection_dim": 2048,
  "pos_embed_max_size": 192,
  "sample_size": 128
}
